In [23]:
import pandas as pd
import os

In [45]:
!type examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
df = pd.read_csv('examples/ex1.csv')

In [46]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [47]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [34]:
!type examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [44]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [43]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [37]:
names = ['a', 'b', 'c', 'd', 'message']

In [38]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [42]:
!type examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [48]:
parsed = pd.read_csv('examples/csv_mindex.csv',  index_col=['key1', 'key2'])

In [49]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [50]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [51]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [52]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [54]:
!type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [57]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [59]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [60]:
result = pd.read_csv('examples/ex5.csv')

In [61]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [62]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [63]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [64]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [65]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [66]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [67]:
 pd.options.display.max_rows = 10

In [68]:
result = pd.read_csv('examples/ex6.csv')

In [69]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [70]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [72]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [73]:
chunker

In [75]:
tot = pd.Series([])

In [76]:
for piece in chunker:     
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [77]:
tot = tot.sort_values(ascending=False)

In [78]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [79]:
data = pd.read_csv('examples/ex5.csv')

In [80]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [81]:
data.to_csv('examples/out.csv')

In [82]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [83]:
import sys

In [84]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [85]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [86]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [87]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [88]:
dates = pd.date_range('1/1/2000', periods=7)

In [89]:
ts = pd.Series(np.arange(7), index=dates)

In [90]:
ts.to_csv('examples/tseries.csv')

In [91]:
!type examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [92]:
!type examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [93]:
import csv

In [94]:
f = open('examples/ex7.csv')

In [95]:
reader = csv.reader(f)

In [96]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [97]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [98]:
header, values = lines[0], lines[1:]

In [99]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [100]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [101]:
class my_dialect(csv.Dialect):     
    lineterminator = '\n'     
    delimiter = ';'     
    quotechar = '"'     
    quoting = csv.QUOTE_MINIMAL

In [103]:
reader = csv.reader(f, delimiter='|')

TypeError: argument 1 must be an iterator

In [104]:
with open('mydata.csv', 'w') as f:     
    writer = csv.writer(f, dialect=my_dialect)     
    writer.writerow(('one', 'two', 'three'))     
    writer.writerow(('1', '2', '3'))     
    writer.writerow(('4', '5', '6'))     
    writer.writerow(('7', '8', '9'))

In [105]:
obj = """ {
"name": "Wes",  
"places_lived": ["United States", "Spain", "Germany"],  
"pet": null,  
"siblings": [{"name": "Scott", "age": 30, 
            "pets": ["Zeus", "Zuko"]},              
            {"name": "Katie", "age": 38,                
            "pets": ["Sixes", "Stache", "Cisco"]}] } 
"""

In [106]:
import json

In [107]:
result = json.loads(obj)

In [108]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [109]:
asjson = json.dumps(result)

In [110]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [111]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [112]:
!type examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [113]:
data = pd.read_json('examples/example.json')

In [114]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [115]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [116]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [117]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [118]:
len(tables)

1

In [119]:
failures = tables[0]

In [120]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [121]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [123]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [126]:
from lxml import objectify
path = 'datasets/mta_perf/Performance_MNR.xml' 
parsed = objectify.parse(open(path)) 
root = parsed.getroot()

In [127]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',  'DESIRED_CHANGE', 'DECIMAL_PLACES']
for elt in root.INDICATOR:    
    el_data = {}     
    for child in elt.getchildren():
        if child.tag in skip_fields:             
            continue         
        el_data[child.tag] = child.pyval     
    data.append(el_data)

In [128]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [129]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [130]:
root

In [131]:
root.get('href')

'http://www.google.com'

In [132]:
root.text

'Google'

In [133]:
frame = pd.read_csv('examples/ex1.csv')

In [134]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [135]:
frame.to_pickle('examples/frame_pickle')

In [136]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [138]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5') 
store['obj1'] = frame
store['obj1_col'] = frame['a']

In [139]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [140]:
store['obj1']

           a
0  -0.051044
1  -0.583308
2  -2.166392
3   0.770175
4   0.058271
..       ...
95 -1.049234
96 -0.699896
97 -1.089446
98  1.215889
99  1.979984

[100 rows x 1 columns]

In [141]:
store.put('obj2', frame, format='table')

In [142]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.540885
11  1.069242
12  2.407051
13 -0.072497
14 -0.046016
15 -0.348195

In [147]:
store.close()

In [185]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

ValueError: The file 'mydata.h5' is already opened, but not in read-only mode (as requested).

In [156]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [157]:
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [158]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [159]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [160]:
writer = pd.ExcelWriter('examples/ex2.xlsx') 
frame.to_excel(writer, 'Sheet1')
writer.save()

In [161]:
frame.to_excel('examples/ex2.xlsx')

In [162]:
import requests

In [163]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [164]:
resp = requests.get(url)

In [165]:
resp

In [166]:
data = resp.json()

In [167]:
data[0]['title']

'Make pandas.to_parquet handles partition columns better'

In [168]:
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])

In [169]:
issues

,number,title,labels,state
0,27117,Make pandas.to_parquet handles partition colum...,[],open
1,27116,Bump python_requires to 3.5.2,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
2,27114,Decoupled more xlrd reading tests from openpyxl,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
3,27111,TST: openpyxl tests fail if xlrd is not installed,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
4,27110,BUG: Fix indexing on DatetimeBlock,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,27073,ENH: Json fill_value for missing fields,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
26,27072,[POC] CLN: use ExtensionBlock for datetime tz ...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
27,27070,Add semantic analyser,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
28,27069,Feature request: make read_parquet support rea...,[],open
29,27067,DOC: Exception raised if columns do not match ...,"[{'id': 1049312478, 'node_id': 'MDU6TGFiZWwxMD...",open

In [170]:
import sqlite3

In [171]:
 query = """ 
 CREATE TABLE test
 (a VARCHAR(20), b VARCHAR(20), 
 c REAL,        d INTEGER    
 );"""

In [172]:
con = sqlite3.connect('mydata.sqlite')

In [173]:
con.execute(query)

In [174]:
con.commit()

In [175]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [176]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [177]:
con.executemany(stmt, data)

In [178]:
cursor = con.execute('select * from test')

In [179]:
rows = cursor.fetchall()

In [180]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [181]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [182]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [184]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []